# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"
import sys
import os

import my_modules as my

choice = 0

while choice != '5':
    print('''
    1. Перейти в папку
    2. Просмотреть содержимое папки
    3. Удалить папку
    4. Создать папку
    5. Выйти из программы
    ''')

    choice = input('Введите номер пункта, который хотите выполнить: ')

    if choice == '1':
        dir_name = input('Введите название папки: ')
        my.ch_dir(dir_name)
    elif choice == '2':
        my.list_dir()
    elif choice == '3':
        dir_name = input('Введите название папки: ')
        my.del_dir(dir_name)
    elif choice == '4':
        dir_name = input('Введите название папки: ')
        my.add_dir(dir_name)





# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py
